lvx/base/AccumulationRegisters/бит_КонтрольныеЗначенияБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_КонтрольныеЗначенияБюджетов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСценарийКонтроль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарийИсполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарийСверхЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСценарийКонтроль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСценарийИсполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСценарийСверхЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Comment>Документ планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РежимКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыКонтроляПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийКонтролируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 5</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПериодичностьПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/CommonModules/бит_КонтрольПоБюджету/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции механизма контроля по бюджету.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция формирует полный текст запроса для контроля по бюджету.
// 
// Параметры:
// СтруктураПараметров - Структура.
// 
// Возвращаемое значение:
//   ТекстЗапроса - Строка.
// 
Функция СформироватьТекстЗапросаДляКонтроля(СтруктураПараметров) Экспорт

	ИзмеренияКонтроля             = СтруктураПараметров.ИзмеренияКонтроля;
	КонтролироватьНеУстановленные = СтруктураПараметров.КонтролироватьНеУстановленные;
	Сценарий                      = СтруктураПараметров.Сценарий;
	РежимКонтроля                 = СтруктураПараметров.РежимКонтроля;
	
	Если СтрСравнить(РежимКонтроля, "Заявки") = 0 Тогда
		УсловиеНаСценарий = Истина;
	ИначеЕсли СтрСравнить(РежимКонтроля, "ГрафикиДоговоров") = 0 Тогда
		УсловиеНаСценарий = Истина;
	Иначе
		УсловиеНаСценарий = Ложь;
	КонецЕсли; 
	
    Периодичность = ПериодичностьКонтроляСценария(Сценарий);
	СтрПериодичность = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ПериодичностьПланирования,Периодичность);
	
	Разделитель =
	"
	|;
	|/////////////////////////////////////////////////////////////
	|";
	ТекстыЗапросовПакета = Новый Массив;
	
	ТекстТаблицаДляКонтроля      = ТекстЗапросаТаблицаДляКонтроля(ИзмеренияКонтроля, РежимКонтроля);
	ТекстОстатки                 = ТекстЗапросаОстаткиПоБюджету(ИзмеренияКонтроля, СтрПериодичность,
																			УсловиеНаСценарий, РежимКонтроля);
	ТекстНаличиеАналитик         = ТекстЗапросаНаличиеАналитик(ИзмеренияКонтроля);
	ТекстКонтрольНаличиеАналитик = ТекстЗапросаКонтрольНаличиеАналитик(ИзмеренияКонтроля);
	ТекстКонтроль                = ТекстЗапросаКонтроль(ИзмеренияКонтроля, КонтролироватьНеУстановленные);
	
	ТекстУдалить = 
	"УНИЧТОЖИТЬ ТаблицаОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДляКонтроля
	|;				   
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НаличиеАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДляКонтроляНаличиеАналитик";
	
	ТекстыЗапросовПакета.Добавить(ТекстТаблицаДляКонтроля);
	ТекстыЗапросовПакета.Добавить(ТекстОстатки);
	ТекстыЗапросовПакета.Добавить(ТекстНаличиеАналитик);
	ТекстыЗапросовПакета.Добавить(ТекстКонтрольНаличиеАналитик);
	ТекстыЗапросовПакета.Добавить(ТекстКонтроль);
	ТекстыЗапросовПакета.Добавить(ТекстУдалить);
	
	Если СтрСравнить(РежимКонтроля, "Бюджет") = 0 Тогда
		ТекстыЗапросовПакета.Добавить("УНИЧТОЖИТЬ ТаблицаДляКонтроляНач");
	КонецЕсли; 			   
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросовПакета, Разделитель);
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция обрабатывает результат выполнения запроса для контроля по бюджету. Заполняется таблица
// движений регистра бит_КонтрольныеЗначенияБюджетов.
// 
// Параметры:
//  Результат           - РезультатЗапроса.
//  ТаблицаДвижений     - ТаблицаЗначений - Таблица движений регистра бит_КонтрольныеЗначенияБюджетов.
//  СтруктураПараметров - Структура.
//  Отказ               - Булево.
//  Заголовок           - Строка.
// 
// Возвращаемое значение:
// 	МассивСтрокПревышения - массив - массив структур, каждая строка по которой произошло превышение бюджета
// 									преобразуется в структуру и помещается в массив.
// 
Функция ОбработатьРезультатКонтроля(Результат, ТаблицаДвижений, СтруктураПараметров, Отказ, Заголовок) Экспорт
	
	// Массив содержит строки по которым произошло превышение бюджета.
	МассивСтрокПревышения = Новый Массив;
	
	ИзмеренияКонтроля    = СтруктураПараметров.ИзмеренияКонтроля;	
	Сценарий             = СтруктураПараметров.Сценарий;
	КонтролироватьБюджет = СтруктураПараметров.КонтролироватьБюджет;
	СверхБюджета         = СтруктураПараметров.СверхБюджета;
	РежимКонтроля        = ?(СтруктураПараметров.Свойство("РежимКонтроля"), СтруктураПараметров.РежимКонтроля, "");
	
	Объект = Неопределено;
	СтруктураПараметров.Свойство("Объект", Объект);
	
	ВалютаСценария       = Сценарий.Валюта;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	флЕстьПревышение = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		// Добавим строку в таблицу движений по регистру контролируемых значений.
		СтрокаДвижение = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижение,Выборка);
		СтрокаДвижение.СуммаСценарийИсполнение = Выборка.Сумма;
		СтрокаДвижение.КоличествоСценарийИсполнение = Выборка.Количество;
		Если НЕ ЗначениеЗаполнено(СтрокаДвижение.Сценарий) Тогда
			СтрокаДвижение.Сценарий = Сценарий;
		КонецЕсли; 
		
		флКонтрольКоличества = Ложь;		
		флКонтрольСуммы      = Истина;
		
		// Возможно статья оборотов является не лимитируемой для текущего режима контроля.
		Если СтрСравнить(РежимКонтроля, "Заявки") = 0 Тогда
			ЭтоЛимитируемаяСтатья = НЕ Выборка.НеКонтролировать_Заявки;
		ИначеЕсли СтрСравнить(РежимКонтроля, "Бюджет") = 0 Тогда
			ЭтоЛимитируемаяСтатья = НЕ Выборка.НеКонтролировать_Бюджеты;
			флКонтрольКоличества = НЕ Выборка.НеКонтролировать_Количество;		
			флКонтрольСуммы      = НЕ Выборка.НеКонтролировать_Сумма;
		ИначеЕсли СтрСравнить(РежимКонтроля, "ГрафикиДоговоров") = 0 Тогда
			ЭтоЛимитируемаяСтатья = НЕ Выборка.НеКонтролировать_Графики;
		Иначе
			ЭтоЛимитируемаяСтатья = Истина;
		КонецЕсли;
		
		// Обработаем ситуацию превышения бюджета
		Если КонтролироватьБюджет 
			 И (    ( Выборка.Разность<0 И флКонтрольСуммы) 
			     ИЛИ( Выборка.КоличествоРазность<0 И флКонтрольКоличества )) 
			 И ЭтоЛимитируемаяСтатья Тогда
			
			флЕстьПревышение = Истина;
			
			Периодичность = ПериодичностьКонтроляСценария(Сценарий);
			
			ПредставлениеПериода = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(Выборка.Период,Периодичность);   
			
			// Каждую строку преобразуем в структуру
			СтруктураСтрокиПревышения = Новый Структура;
			
			СтруктураСтрокиПревышения.Вставить("Период"				, Выборка.Период);
			СтруктураСтрокиПревышения.Вставить("СтатьяОборотов"		, Выборка.СтатьяОборотов);
			СтруктураСтрокиПревышения.Вставить("Остаток"			, Выборка.Остаток);
			СтруктураСтрокиПревышения.Вставить("Сумма"				, Выборка.Сумма);
			СтруктураСтрокиПревышения.Вставить("Разность"			, Выборка.Разность);
			СтруктураСтрокиПревышения.Вставить("КоличествоОстаток"	, Выборка.КоличествоОстаток);
			СтруктураСтрокиПревышения.Вставить("Количество"			, Выборка.Количество);
			СтруктураСтрокиПревышения.Вставить("КоличествоРазность"	, Выборка.КоличествоРазность);
			
			// Соберем информацию о заполнении доп. аналитик.
			ТекстАналитика = Новый Массив(); 
			ШаблонАналитики = "- %1 = ""%2""";
			Для каждого КлючИЗначение Из ИзмеренияКонтроля Цикл
				ИмяИзмерения = КлючИЗначение.Ключ;
				Синоним = КлючИЗначение.Значение.Синоним;
				Если Выборка["Есть"+ИмяИзмерения] = 1 Тогда
					Если ЗначениеЗаполнено(Выборка[ИмяИзмерения]) Тогда
						ТекстАналитика.Добавить(СтрШаблон(ШаблонАналитики, Синоним, Выборка[ИмяИзмерения]));
					КонецЕсли; 
					СтруктураСтрокиПревышения.Вставить(ИмяИзмерения, Выборка[ИмяИзмерения]);
				КонецЕсли; 
			КонецЦикла; 
			
			ТекстАналитика = СтрСоединить(ТекстАналитика, Символы.ПС);
			ТекстАналитика = ?(ПустаяСтрока(ТекстАналитика), "", Символы.ПС) + ТекстАналитика;
			ТекстСообщения = НСтр("ru='По сценарию ""%1"", по аналитике:
								      |- Статья оборотов = ""%2"" %3 превышен бюджет периода %4.';
								  |en='For scenario ""%1"", for analytics:
									  |- Turnover item ""%2"" %3 budget of period exceeded %4.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Сценарий, Выборка.СтатьяОборотов, ТекстАналитика, ПредставлениеПериода);
			
			Если Выборка.Разность <0 И флКонтрольСуммы Тогда				
				Расшифровка = НСтр("ru=' Остаток бюджета: %1, сумма в документе: %2, не достаточно: %3.'; 
								   |en=' Budget balance: %1, amount in the document: %2, not enough: %3.'");
				Расшифровка = СтрШаблон(Расшифровка, 
										бит_ОбщегоНазначения.ФорматСумм(Выборка.Остаток, ВалютаСценария, "0.00"), 
										бит_ОбщегоНазначения.ФорматСумм(Выборка.Сумма, ВалютаСценария, "0.00"),
										бит_ОбщегоНазначения.ФорматСумм(-Выборка.Разность, ВалютаСценария, "0.00"));
												
				ТекстСообщения = ТекстСообщения + Расшифровка;   								
			КонецЕсли; 
			
			Если Выборка.КоличествоРазность <0 И флКонтрольКоличества Тогда				
				Расшифровка = НСтр("ru=' Количество бюджета: %1, количество в документе: %2, не достаточно: %3.';
								   |en=' Budget quantity: %1, quantity in  the document: %2, not enough: %3.'");
				Расшифровка = СтрШаблон(Расшифровка, 
										бит_ОбщегоНазначения.ФорматСумм(Выборка.КоличествоОстаток,, "0.000"),
										бит_ОбщегоНазначения.ФорматСумм(Выборка.Количество,, "0.000"),
										бит_ОбщегоНазначения.ФорматСумм(-Выборка.КоличествоРазность,, "0.000"));
												
				ТекстСообщения = ТекстСообщения + Расшифровка; 
			КонецЕсли; 
			
			МассивСтрокПревышения.Добавить(СтруктураСтрокиПревышения);
			
			Если Сверхбюджета Тогда
				// Эксперимент: Принято решение не сообщать пользователю, если документ проводится "сверх бюджета".
				// Поэтому очистм массив.
				МассивСтрокПревышения = Новый Массив(); 
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект); 
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект,,,Отказ); 
			КонецЕсли; 
		КонецЕсли; // Превышен бюджет.
	КонецЦикла;  // По выборке.
	
	Если флЕстьПревышение И СверхБюджета Тогда
		ТекстСообщения = НСтр("ru='Документ проведен сверх бюджета.';
							  |en='Document will be entered off the budget'");
		// Эксперимент: Принято решение не сообщать пользователю, если документ проводится "сверх бюджета".
		//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект);  
	КонецЕсли; 
	
    Возврат МассивСтрокПревышения;
	
КонецФункции

// Функция формирует структуру, описывающую набор измерений для контроля по бюджету.
// 
// Параметры:
//  МассивИсключений  - Массив.
//  ИзмеренияТипы     - Структура.
//  ИзмеренияСинонимы - Структура.
//  НастройкиДопИзмерений - Соответствие.
// 
// Возвращаемое значение:
//   ИзмеренияКонтроля   - Структура
// 
Функция КонструкторСтруктурыИзмеренияКонтроля(МассивИсключений, ИзмеренияТипы = Неопределено, ИзмеренияСинонимы = Неопределено, НастройкиДопИзмерений = Неопределено) Экспорт
											  
    Если МассивИсключений = Неопределено Тогда
		 МассивИсключений = Новый Массив;
	КонецЕсли; 											  
	
	Если ИзмеренияТипы = Неопределено Тогда
	    ИзмеренияТипы = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все","Тип",,МассивИсключений);
	КонецЕсли; 
	
	Если ИзмеренияСинонимы = Неопределено Тогда
		ИзмеренияСинонимы = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все","Синоним",,МассивИсключений);
	КонецЕсли; 
	
	Если НастройкиДопИзмерений = Неопределено Тогда
		 НастройкиДопИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли; 
	
	ИзмеренияКонтроля = Новый Структура;
	
	Для каждого КлючИЗначение Из ИзмеренияТипы Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		Если Найти(ИмяИзмерения,"Аналитика_")>0 Тогда
			НастройкаИзмерения = НастройкиДопИзмерений[ИмяИзмерения];
			Если НастройкаИзмерения = Неопределено Тогда
			     Продолжить;
			Иначе	
			     Синоним        = НастройкаИзмерения.Синоним;
				 ПустоеЗначение = НЕОПРЕДЕЛЕНО;
			КонецЕсли; 
		Иначе	
			ПустоеЗначение = КлючИЗначение.Значение.ПривестиЗначение();
			Синоним        = ИзмеренияСинонимы[ИмяИзмерения];
		КонецЕсли; 
		Параметры = КонструкторСтруктурыКонтроля(Синоним,ПустоеЗначение);
	    ИзмеренияКонтроля.Вставить(ИмяИзмерения,Параметры);
	КонецЦикла; 
	
	Возврат ИзмеренияКонтроля;

КонецФункции

// Процедура заполняет параметры запроса контроля по структуре измерений контроля.
// 
// Параметры:
//  ТаблицаДляКонтроля  - ИмяИзмерения.
//  ИзмеренияКонтроля   - Структура.
//  Запрос              - Запрос.
// 
Процедура ЗаполнитьПараметрыПоИзмерениямКонтроля(ТаблицаДляКонтроля, ИзмеренияКонтроля, Запрос) Экспорт

   Для каждого КлючИЗначение Из ИзмеренияКонтроля Цикл
	   
	   ИмяИзмерения = КлючИЗначение.Ключ;
	   Параметры    = КлючИЗначение.Значение;
	   
	   МассивПараметров = ТаблицаДляКонтроля.ВыгрузитьКолонку(ИмяИзмерения);
	   бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивПараметров);		 
	   МассивПараметров.Добавить(Неопределено);
	   МассивПараметров.Добавить(Параметры.ПустоеЗначение);
	   
	   Запрос.УстановитьПараметр("Массив"+ИмяИзмерения,МассивПараметров);
	   Запрос.УстановитьПараметр("Пусто"+ИмяИзмерения,Параметры.ПустоеЗначение);
	   
   КонецЦикла; 

КонецПроцедуры

// Процедура сворачивает таблицу для контроля по измерениям для контроля.
// 
// Параметры:
//  ТаблицаДляКонтроля  - ТаблицаЗначений.
//  ИзмеренияКонтроля   - Структура.
//  Периодичность       - ПеречислениеСсылка.бит_ПериодичностьПланирования.
// 
Процедура СвернутьТаблицуКонтроля(ТаблицаДляКонтроля, ИзмеренияКонтроля, Периодичность) Экспорт
	
	ИзмеренияДляСвертки = "Период,Сценарий,СтатьяОборотов";
	
	Для каждого СтрокаТаблицы Из ТаблицаДляКонтроля Цикл
		СтрокаТаблицы.Период = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(СтрокаТаблицы.Период,Периодичность);
	КонецЦикла; 
	
	Для каждого КлючИЗначение Из ИзмеренияКонтроля Цикл
		ИзмеренияДляСвертки = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(ИзмеренияДляСвертки,КлючИЗначение.Ключ,",");
	КонецЦикла; 
	
	ТаблицаДляКонтроля.Свернуть(ИзмеренияДляСвертки,"Сумма,Количество");
	
КонецПроцедуры

// Функция получает периодичность с которой контролируется сценарий сценария. 
// Если значение периодичности не удалось 
// определить возвращается периодичность МЕСЯЦ.
// 
// Параметры:
//  Сценарий  - СправочникСсылка.СценарииПланирования.
// 
// Возвращаемое значение:
//   Периодичность   - СправочникСсылка.бит_ПериодичностьПланирования.
// 
Функция ПериодичностьКонтроляСценария(Сценарий) Экспорт
	
	Периодичность = Сценарий.ПериодичностьКонтроля;
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц;
	КонецЕсли; 
	
	Возврат Периодичность;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует текст запроса извлечения данных из таблицы контроля. В режиме контроля по бюджету
// проверяется необходимость контроля по регистру сведений бит_НастройкиКонтроляПоСценариям.
// 
// Параметры:
//  ИзмеренияДоп - Структура
//  РежимКонтроля  - Строка - "Заявки", "Бюджет", "ГрафикиДоговоров".
// 
// Возвращаемое значение:
//   ТекстЗапроса   - Строка.
// 
Функция ТекстЗапросаТаблицаДляКонтроля(ИзмеренияДоп, РежимКонтроля) 

	Если СтрСравнить(РежимКонтроля, "Заявки") = 0 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДляКонтроля.Период КАК Период,
		|	ТаблицаДляКонтроля.Сценарий КАК Сценарий,
		|	ТаблицаДляКонтроля.СтатьяОборотов КАК СтатьяОборотов,
		|	&ИзмеренияДоп КАК ИзмеренияДоп,
		|	ТаблицаДляКонтроля.Количество КАК Количество,
		|	ТаблицаДляКонтроля.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаДляКонтроля
		|ИЗ
		|	&ТаблицаДляКонтроля КАК ТаблицаДляКонтроля";
	ИначеЕсли СтрСравнить(РежимКонтроля, "ГрафикиДоговоров") = 0 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДляКонтроля.Период КАК Период,
		|	ТаблицаДляКонтроля.Сценарий КАК Сценарий,
		|	ТаблицаДляКонтроля.СтатьяОборотов КАК СтатьяОборотов,
		|	&ИзмеренияДоп КАК ИзмеренияДоп,
		|	ТаблицаДляКонтроля.Количество КАК Количество,
		|	ТаблицаДляКонтроля.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаДляКонтроля
		|ИЗ
		|	&ТаблицаДляКонтроля КАК ТаблицаДляКонтроля";
	ИначеЕсли СтрСравнить(РежимКонтроля, "Бюджет") = 0 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДляКонтроля.Период КАК Период,
		|	ТаблицаДляКонтроля.Сценарий КАК Сценарий,
		|	ТаблицаДляКонтроля.СтатьяОборотов КАК СтатьяОборотов,
		|	&ИзмеренияДоп КАК ИзмеренияДоп,
		|	ТаблицаДляКонтроля.Количество КАК Количество,
		|	ТаблицаДляКонтроля.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаДляКонтроляНач
		|ИЗ
		|	&ТаблицаДляКонтроля КАК ТаблицаДляКонтроля
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДляКонтроляНач.Период КАК Период,
		|	ТаблицаДляКонтроляНач.СтатьяОборотов КАК СтатьяОборотов,
		|	&ИзмеренияДопНач КАК ИзмеренияДопНач,
		|	ТаблицаДляКонтроляНач.Количество КАК Количество,
		|	ТаблицаДляКонтроляНач.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаДляКонтроля
		|ИЗ
		|	ТаблицаДляКонтроляНач КАК ТаблицаДляКонтроляНач
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК ВключениеКонтроля
		|		ПО ТаблицаДляКонтроляНач.Сценарий = ВключениеКонтроля.Сценарий
		|			И ТаблицаДляКонтроляНач.Период >= ВключениеКонтроля.Период
		|			И (ТаблицаДляКонтроляНач.Период <= ВключениеКонтроля.ДатаОкончания
		|				ИЛИ ВключениеКонтроля.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	НЕ ВключениеКонтроля.Сценарий ЕСТЬ NULL";
	КонецЕсли; 
	
	Разделитель = "," + Символы.ПС + Символы.Таб;
	ПоляИзмеренияДоп = Новый Массив;
	ПоляИзмеренияДопНач = Новый Массив;
	Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
		ПоляИзмеренияДоп.Добавить("ТаблицаДляКонтроля." + КлючИЗначение.Ключ);
		ПоляИзмеренияДопНач.Добавить("ТаблицаДляКонтроляНач." + КлючИЗначение.Ключ);
	КонецЦикла; 
	
	ТекстИзмеренияДоп    = СтрСоединить(ПоляИзмеренияДоп, Разделитель);
	ТекстИзмеренияДопНач = СтрСоединить(ПоляИзмеренияДопНач, Разделитель);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДоп КАК ИзмеренияДоп", ТекстИзмеренияДоп);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДопНач КАК ИзмеренияДопНач", ТекстИзмеренияДопНач);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует текст выборки контрольных значений из регистра бит_КонтрольныеЗначенияБюджетов.
// 
// Параметры:
//  ИзмеренияДоп  - Структура
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования
//  УсловиеНаСценарий  - Булево.
// 
// Возвращаемое значение:
// ТекстЗапроса   - Строка.
// 
Функция ТекстЗапросаОстаткиПоБюджету(ИзмеренияДоп, Периодичность, УсловиеНаСценарий, РежимКонтроля) 
	
	// Измерение СценарийКонтролируемый стало составного типа и по умолчанию там стоит значение Неопределено.
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(КонтрольныеЗначения.СуммаСценарийКонтрольОборот) КАК СуммаСценарийКонтроль,
	|	СУММА(КонтрольныеЗначения.СуммаСценарийИсполнениеОборот) КАК СуммаСценарийИсполнение,
	|	СУММА(КонтрольныеЗначения.СуммаСценарийКонтрольОборот - КонтрольныеЗначения.СуммаСценарийИсполнениеОборот) КАК Остаток,
	|	СУММА(КонтрольныеЗначения.КоличествоСценарийКонтрольОборот) КАК КоличествоСценарийКонтроль,
	|	СУММА(КонтрольныеЗначения.КоличествоСценарийИсполнениеОборот) КАК КоличествоСценарийИсполнение,
	|	СУММА(КонтрольныеЗначения.КоличествоСценарийКонтрольОборот - КонтрольныеЗначения.КоличествоСценарийИсполнениеОборот) КАК КоличествоОстаток,				   
	|	%Период% КАК Период,
	|	КонтрольныеЗначения.Сценарий КАК Сценарий,				   
	|	КонтрольныеЗначения.СтатьяОборотов КАК СтатьяОборотов,
	|	%ИзмеренияДоп%
	|ПОМЕСТИТЬ ТаблицаОстаток
	|ИЗ
	|	РегистрНакопления.бит_КонтрольныеЗначенияБюджетов.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			%Периодичность%,
	|			ВЫБОР
	|				КОГДА СценарийКонтролируемый = НЕОПРЕДЕЛЕНО
	|						ИЛИ СценарийКонтролируемый ЕСТЬ NULL
	|					ТОГДА %СправочникСценарии% = &СценарийКонтролируемый
	|				ИНАЧЕ СценарийКонтролируемый = &СценарийКонтролируемый
	|			КОНЕЦ
	|			%УсловиеНаСценарий%
	|			И СтатьяОборотов В ИЕРАРХИИ (&МассивСтатьяОборотов)
	|			%Отбор%) КАК КонтрольныеЗначения
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольныеЗначения.Период,	
	|	КонтрольныеЗначения.Сценарий,				   				   
	|	КонтрольныеЗначения.СтатьяОборотов,
	|	%ИзмеренияДоп%
	|%УсловиеБюджет%";
	
	Разделитель = "," + Символы.ПС + Символы.Таб;
	РаздлительОтбра = Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб + "И ";
	ПоляИзмеренияДоп = Новый Массив;
	ПараметрыОтбора = Новый Массив;
	Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
		ИмяПоляДоп = СтрШаблон("КонтрольныеЗначения.%1", КлючИЗначение.Ключ);
		СтрОтбор = СтрШаблон("%1 В (&Массив%1)", КлючИЗначение.Ключ);
		ПоляИзмеренияДоп.Добавить(ИмяПоляДоп);
		ПараметрыОтбора.Добавить(СтрОтбор);
	КонецЦикла; 
	
	ТекстИзмеренияДоп = СтрСоединить(ПоляИзмеренияДоп, Разделитель);
	Если ПараметрыОтбора.Количество() > 0 Тогда
		ТекстОтбор = "И " + СтрСоединить(ПараметрыОтбора, РаздлительОтбра);
	Иначе
		ТекстОтбор = "";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИзмеренияДоп%", ТекстИзмеренияДоп);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Отбор%", ТекстОтбор);
	
	ТекстПериод = СтрШаблон("НАЧАЛОПЕРИОДА(КонтрольныеЗначения.Период, %1)", Периодичность);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Период%", ТекстПериод);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Периодичность%", Периодичность);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СправочникСценарии%",
								"ЗНАЧЕНИЕ(Справочник."+ИмяСправочникаСценарии+".ПустаяСсылка)");
	
	Если УсловиеНаСценарий Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНаСценарий%", " И Сценарий = &Сценарий");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНаСценарий%", "");
	КонецЕсли; 
	
	Если СтрСравнить(РежимКонтроля, "Бюджет") = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеБюджет%",
									"ИМЕЮЩИЕ
									|	СУММА(КонтрольныеЗначения.СуммаСценарийКонтрольОборот) > 0");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеБюджет%",""); 
	КонецЕсли;
	
	Возврат ТекстЗапроса;				   

КонецФункции

// Функция формирует фрагмент текста запроса, отвечающий за определение необходимости 
// контроля по аналитикам.
// 
// Параметры:
//  ИзмеренияДоп  - Структура.
// 
// Возвращаемое значение:
//   ТекстЗапроса   - Строка.
// 
Функция ТекстЗапросаНаличиеАналитик(ИзмеренияДоп) 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаОстаток.Период КАК Период,
	|	ТаблицаОстаток.Сценарий КАК Сценарий,
	|	ТаблицаОстаток.СтатьяОборотов КАК СтатьяОборотов,
	|	&НаличиеАналитик КАК НаличиеАналитик
	|ПОМЕСТИТЬ НаличиеАналитик
	|ИЗ
	|	ТаблицаОстаток КАК ТаблицаОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОстаток.Период,
	|	ТаблицаОстаток.Сценарий,
	|	ТаблицаОстаток.СтатьяОборотов";
	
	Разделитель = "," + Символы.ПС + Символы.Таб;
	ПоляНаличияАналитик = Новый Массив;
	Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
		Стр =
		"МАКСИМУМ(ВЫБОР
		|			КОГДА ТаблицаОстаток.%1 = &Пусто%1
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК %1";
		Стр = СтрШаблон(Стр, КлючИЗначение.Ключ);
		ПоляНаличияАналитик.Добавить(Стр);
	КонецЦикла; 
	
	ТекстНаличиеАналитик = СтрСоединить(ПоляНаличияАналитик, Разделитель);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НаличиеАналитик КАК НаличиеАналитик", ТекстНаличиеАналитик);
	
	Возврат ТекстЗапроса;				   

КонецФункции

// Функция формирует фрагмент текста запроса выбирающий из таблицы контроля только те аналитики,
// по которым необходимо провести контроль.
// 
// Параметры:
//  ИзмеренияДоп  - Структура.
// 
// Возвращаемое значение:
//   ТекстЗапроса   - Строка.
// 
Функция ТекстЗапросаКонтрольНаличиеАналитик(ИзмеренияДоп) 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДляКонтроля.Период КАК Период,
	|	НаличиеАналитик.Сценарий КАК Сценарий,
	|	ТаблицаДляКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	&ИзмеренияДоп КАК ИзмеренияДоп,
	|	СУММА(ТаблицаДляКонтроля.Количество) КАК Количество,
	|	СУММА(ТаблицаДляКонтроля.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаДляКонтроляНаличиеАналитик
	|ИЗ
	|	ТаблицаДляКонтроля КАК ТаблицаДляКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеАналитик КАК НаличиеАналитик
	|		ПО ТаблицаДляКонтроля.Период = НаличиеАналитик.Период
	|			И ТаблицаДляКонтроля.СтатьяОборотов = НаличиеАналитик.СтатьяОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДляКонтроля.Период,
	|	НаличиеАналитик.Сценарий,
	|	ТаблицаДляКонтроля.СтатьяОборотов,
	|	%СгруппироватьДоп%";

	Разделитель = "," + Символы.ПС + Символы.Таб;
	ПоляИзмеренияДоп = Новый Массив;
	ПоляГруппировкиДоп = Новый Массив;
	Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
		СтрГруппировкаДоп = 
		"ВЫБОР
		|		КОГДА ЕСТЬNULL(НаличиеАналитик.%1, 0) = 1 
		|			ТОГДА ТаблицаДляКонтроля.%1
		|		ИНАЧЕ NULL
		|	КОНЕЦ";
		СтрГруппировкаДоп = СтрШаблон(СтрГруппировкаДоп, КлючИЗначение.Ключ);
		
		СтрИзмерениеДоп = СтрГруппировкаДоп + " КАК %1,
		|	МАКСИМУМ(ЕСТЬNULL(НаличиеАналитик.%1, 0)) КАК Есть%1";
		СтрИзмерениеДоп = СтрШаблон(СтрИзмерениеДоп, КлючИЗначение.Ключ);
		
		ПоляИзмеренияДоп.Добавить(СтрИзмерениеДоп);
		ПоляГруппировкиДоп.Добавить(СтрГруппировкаДоп);
	КонецЦикла; 	
	
	ТекстИзмеренияДоп = СтрСоединить(ПоляИзмеренияДоп, Разделитель);
	ТекстСгруппироватьДоп = СтрСоединить(ПоляГруппировкиДоп, Разделитель);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДоп КАК ИзмеренияДоп", ТекстИзмеренияДоп);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СгруппироватьДоп%", ТекстСгруппироватьДоп);
	
    Возврат ТекстЗапроса;				   
				   
КонецФункции

// Функция формирует фрагмент текста запроса, осуществляющего контроль.
// 
// Параметры:
//  ИзмеренияДоп  - Структура
//  КонтролироватьНеУстановленные  - Булево.
// 
// Возвращаемое значение:
//   ТекстЗапроса   - Строка.
// 
Функция ТекстЗапросаКонтроль(ИзмеренияДоп, КонтролироватьНеУстановленные) 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДляКонтроляНаличиеАналитик.Период КАК Период,
	|	ТаблицаОстаток.Сценарий КАК Сценарий,
	|	ТаблицаДляКонтроляНаличиеАналитик.СтатьяОборотов КАК СтатьяОборотов,
	|	ЕСТЬNULL(Таблица.НеКонтролировать_Заявки, ЛОЖЬ) КАК НеКонтролировать_Заявки,
	|	ЕСТЬNULL(Таблица.НеКонтролировать_Количество, ЛОЖЬ) КАК НеКонтролировать_Количество,
	|	ЕСТЬNULL(Таблица.НеКонтролировать_Сумма, ЛОЖЬ) КАК НеКонтролировать_Сумма,
	|	ЕСТЬNULL(Таблица.НеКонтролировать_Бюджеты, ЛОЖЬ) КАК НеКонтролировать_Бюджеты,
	|	ЕСТЬNULL(Таблица.НеКонтролировать_Графики, ЛОЖЬ) КАК НеКонтролировать_Графики,
	|	&ИзмеренияДоп КАК ИзмеренияДоп,
	|	ЕСТЬNULL(ТаблицаДляКонтроляНаличиеАналитик.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТаблицаОстаток.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТаблицаОстаток.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаДляКонтроляНаличиеАналитик.Количество, 0) КАК КоличествоРазность,
	|	ЕСТЬNULL(ТаблицаДляКонтроляНаличиеАналитик.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаОстаток.Остаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ТаблицаОстаток.Остаток, 0) - ЕСТЬNULL(ТаблицаДляКонтроляНаличиеАналитик.Сумма, 0) КАК Разность
	|ИЗ
	|	ТаблицаДляКонтроляНаличиеАналитик КАК ТаблицаДляКонтроляНаличиеАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиОборотов КАК Таблица
	|		ПО ТаблицаДляКонтроляНаличиеАналитик.СтатьяОборотов = Таблица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстаток КАК ТаблицаОстаток
	|		ПО ТаблицаДляКонтроляНаличиеАналитик.Период = ТаблицаОстаток.Период
	|			И ТаблицаДляКонтроляНаличиеАналитик.СтатьяОборотов = ТаблицаОстаток.СтатьяОборотов
	|		%СоединенияДоп%";
				   
	Если НЕ КонтролироватьНеУстановленные Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ГДЕ
		|	(НЕ ТаблицаОстаток.СтатьяОборотов ЕСТЬ NULL)";
	КонецЕсли; 			   
	
	Разделитель = "," + Символы.ПС + Символы.Таб;
	РазделительСоединения = Символы.ПС + "И ";
	ПоляИзмеренияДоп = Новый Массив;
	ПоляСоединенияДоп = Новый Массив;
	Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
		СтрИзмерениеДоп =
		"ТаблицаОстаток.%1,
		|	ТаблицаДляКонтроляНаличиеАналитик.Есть%1";
		СтрИзмерениеДоп = СтрШаблон(СтрИзмерениеДоп, КлючИЗначение.Ключ); 
		ПоляИзмеренияДоп.Добавить(СтрИзмерениеДоп);
		
		СтрСоединение = 
		"(ВЫБОР
		|	КОГДА ТаблицаДляКонтроляНаличиеАналитик.Есть%1 = 1
		|		ТОГДА ТаблицаДляКонтроляНаличиеАналитик.%1 = ТаблицаОстаток.%1
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ)";
		СтрСоединение = СтрШаблон(СтрСоединение, КлючИЗначение.Ключ);
		ПоляСоединенияДоп.Добавить(СтрСоединение);
   КонецЦикла; 
	
   ТекстИзмеренияДоп = СтрСоединить(ПоляИзмеренияДоп, Разделитель);
   
   Если ПоляСоединенияДоп.Количество() > 0 Тогда
	   ТекстСоединенияДоп = "И " + СтрСоединить(ПоляСоединенияДоп, РазделительСоединения);
   Иначе	
	   ТекстСоединенияДоп = "";
   КонецЕсли;
   
   ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДоп КАК ИзмеренияДоп", ТекстИзмеренияДоп);
   ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединенияДоп%", ТекстСоединенияДоп);
   
   Возврат ТекстЗапроса;
				   
КонецФункции

// Функция формирует структуру, описывающую измерение для контроля.
// 
// Параметры:
//  Синоним  - строка
//  ПустоеЗначение  - Произвольный.
// 
// Возвращаемое значение:
//   РезСтруктура   - Структура.
// 
Функция КонструкторСтруктурыКонтроля(Синоним, ПустоеЗначение)

  РезСтруктура = Новый Структура("Синоним,ПустоеЗначение");
  РезСтруктура.Синоним        = Синоним;
  РезСтруктура.ПустоеЗначение = ПустоеЗначение;
  
  Возврат РезСтруктура;

КонецФункции

#КонецОбласти
